articles = [
    ["Раздел 1.",
     [0],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 2.",
     [2, 4],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 3.",
     [0, 1, 2, 3],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 4.",
     [1],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 5.",
     [0, 2],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 6.",
     [4],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 7.",
     [0, 1, 3],
     ["Введение", "Основная часть", "Заключение"]
     ]
]


def get_titles():
    titles = []
    for entry in articles:
        titles.append(entry[0])
    return titles


authors = [
    ['Иванов Иван Иванович', 'Университет, доцент'],
    ['Петров Петр Петрович', 'Университет, доцент'],
    ['Сидоров Сидор Сидорович', 'Университет, доцент'],
    ['Алексеев Алексей Алексеевич', 'Университет, доцент'],
    ['Сергеев Сергей Сергеевич', 'Университет, доцент'],
    ['Юрьев Юрий Юрьевич', 'Университет, доцент'],
]


def author_short():
    author_list = ""
    for author in authors:
        names = author[0].split(" ")
        author_list += names[0] + " " + names[1][0] + "." + names[2][0] + "., "
    return author_list[0:len(author_list)-2]


navigation = [
    ['Главная', "/"],
    ['Статьи', "/article/1"],
    ['Аудиофайлы (подкасты)', "/audios"],
    ['Тесты', "/quizzes"],
    ['Полезные ссылки', "/references"],
]


def get_nav():
    nav = []
    for entry in navigation:
        nav.append(
            {'href': entry[1],
             'name': entry[0]})
    return nav


quizzes = [1, 2]

quiz1 = [
    ["Как звали коня Александря Македонского?", ["Буцефал", "Децибел", "Цеденбал", "Задолбал"], 1],
    ["Дамоклов...", ["Щит", "Меч", "Серп", "Молот"], 2],
    ["Последствия первого конкурса красоты", ["Илиада", "Одиссея", "Троянская война", "Тильзитский мир"], 3],
     ]

quiz2 = [
    ["Пушкина убил...", ["Атос", "Дантес", "Портос", "Арамис"], 2],
    ["План электрификации назывался ...", ["ЦУМ", "ГУМ", "ГУЛАГ", "ГОЭЛРО"], 4],
    ["Чапай был за ...", ["Большевиков", "Коммунистов", "Интернационал", "Мир во всем мире"], 3],
     ]
