articles = [
    ["Раздел 1. Технологические революции и Большие волны инновационного развития XIX-XX вв.",
     [0],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 2. Идеи электрификации в России",
     [2, 4],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 3. План ГОЭЛРО – инновационная программа технологического скачка общенациональной экономики",
     [0, 1, 2, 3],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 4. Люди света: инициаторы, создатели и  исполнители плана ГОЭЛРО",
     [1],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 5. Результаты и мультипликативный эффект электрической революции в России",
     [0, 2],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 6. Российский план ГОЭЛРО: влияние на мировую практику энергостроения",
     [4],
     ["Введение", "Основная часть", "Заключение"]
     ],
    ["Раздел 7. Г.М.Крижановский - главный автор проекта ГОЭЛРО, выдающийся ученый в области энергетики",
     [0, 1, 3],
     ["Введение", "Основная часть", "Заключение"]
     ]
]


def get_titles():
    titles = []
    for entry in articles:
        titles.append(entry[0])
    return titles


authors = [
    ['Тагирова Наиля Фаридовна', 'ФГБОУ ВО «СГЭУ», Кафедра философии и истории, профессор'],
    ['Сумбурова Елена Ивановна', 'ФГБОУ ВО «СГЭУ», Кафедра философии и истории, доцент'],
    ['Соленцова Елена Алексеевна', 'ФГБОУ ВО «СГЭУ», Кафедра философии и истории, доцент'],
    ['Солдатова Ольга Евгеньевна', 'ФГБОУ ВО «СГЭУ», Музей истории , директор'],
    ['Семенова Екатерина Юрьевна', 'ФГБОУ ВО «Самарский государственный технический университет», '
                                   'Кафедра «Социология, политология и история Отечества», профессор'],
    ['Жердева Юлия Александровна', 'НИУ ВО «Самарский национальный исследовательский университет», '
                                   'Кафедра документоведения, профессор'],
]


def author_short():
    author_list = ""
    for author in authors:
        names = author[0].split(" ")
        author_list += names[0] + " " + names[1][0] + "." + names[2][0] + "., "
    return author_list[0:len(author_list)-2]


navigation = [
    ['Главная', "/"],
    ['Статьи', "/article/1"],
    ['Аудиофайлы (подкасты)', "/audios"],
    ['Тесты', "/quizzes"],
    ['Полезные ссылки', "/references"],
]


def get_nav():
    nav = []
    for entry in navigation:
        nav.append(
            {'href': entry[1],
             'name': entry[0]})
    return nav


quizzes = [1, 2]

quiz1 = [
    ["Как звали коня Александря Македонского?", ["Буцефал", "Децибел", "Цеденбал", "Задолбал"], 1],
    ["Дамоклов...", ["Щит", "Меч", "Серп", "Молот"], 2],
    ["Последствия первого конкурса красоты", ["Илиада", "Одиссея", "Троянская война", "Тильзитский мир"], 3],
     ]

quiz2 = [
    ["Пушкина убил...", ["Атос", "Дантес", "Портос", "Арамис"], 2],
    ["План электрификации назывался ...", ["ЦУМ", "ГУМ", "ГУЛАГ", "ГОЭЛРО"], 4],
    ["Чапай был за ...", ["Большевиков", "Коммунистов", "Интернационал", "Мир во всем мире"], 3],
     ]
